<?php 
$i = 1;
while ($i <= 100) {
    if ($i % 3 == 0){
        echo "$i ";
    }
    $i++;
}
echo '<hr>';

$num = 0;
do {
    if ($num == 0) {
        echo $num . ' – это ноль.' . '<br>';
        $num++;
    } elseif ($num % 2 != 0) {
        echo $num . ' – нечетное число.' . '<br>';
        $num++;
    } else {
        echo $num . ' – четное число.' . '<br>';
        $num++;
    }
} while ($num < 11);

echo '<hr>';

$arr = [
    'Московская область:' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область:' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область:' => ['Касимов', 'Кораблино', 'Михайлов', 'Новомичуринск']
];

foreach ($arr as $key => $value) {
    echo $key . '<br>';
    for ($i = 0; $i < $arrLength = count($arr[$key]); $i++) {
        //находим последний элемент вложенного массива для переноса строки
        if ($i == $arrLength - 1) {
            echo $arr[$key][$i] . '.' . '<br>';
        } else {
            //если не последний, ставим запятую
            echo $arr[$key][$i] . ', ';
        }
    }

}
echo '<hr>';

$string = "Написать функцию транслитерации строк.";
 
$translit = array("а" => "a", "б" => "b", "в" => "v", "г" => "g", "д" => "d", "е" => "e", "ё" => "e", "ж" => "zh",  "з" => "z", "и" => "i", "й" => "y", "к" => "k", "л" => "l", "м" => "m", "н" => "n", "о" => "o", "п" => "p", "р" => "r", "с" => "s", "т" => "t", "у" => "u", "ф" => "f", "х" => "kh", "ц" => "c", "ч" => "ch",  "ш" => "sh",  "щ" => "sch", "ь" => "",  "ы" => "y", "ъ" => "", "э" => "e", "ю" => "yu", "я" => "ya");
 
echo strtr($string, $translit);

echo '<hr>';
$string = "Написать функцию транслитерации строк.";
$translit = array(" " => "_");

echo strtr($string, $translit);

echo '<hr>';
for ($i = 0; $i < 10; print $i, $i++){

};
//Подскажите, почему не работает echo?

echo '<hr>';
$arr = [
    'Московская область:' => ['Москва', 'Зеленоград', 'Клин'],
    'Ленинградская область:' => ['Санкт-Петербург', 'Всеволожск', 'Павловск', 'Кронштадт'],
    'Рязанская область:' => [ 'Кораблино', 'Михайлов', 'Новомичуринск','Касимов']
];

foreach ($arr as $key => $value) {
    echo $key . '<br>';
    for ($i = 0; $i < $arrLength = count($arr[$key]); $i++) {
        //находим последний элемент вложенного массива для переноса строки
        if ($i == $arrLength - 1) {
            echo $arr[$key][$i] . '.' . '<br>';
        } else  {
            if ((mb_substr($value, 0, 1) == 'К')){
            //если не последний, ставим запятую
            echo $arr[$key][$i] . ', ';
            }

        } 
    }

}//Не получилось


echo '<hr>';



?>
